; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v10 ?v9)
             (pred_7 ?v2 ?v5)
             (pred_2 ?v10 ?v5)
             (pred_1 ?v1 ?v10 )
	     (pred_10 ?v10)
             (pred_6 ?v13)
             (pred_12 ?v2)
             (pred_4 ?v5)
             (pred_8 ?v10)
             (pred_5 ?v2)
             (pred_11 ?v10)
             (pred_9 ))



(:action op_5
:parameters (?v12 ?v6 ?v11 ?v8)
:precondition (and (pred_6 ?v12) (pred_6 ?v6) (pred_12 ?v11) (pred_4 ?v8)
          (pred_3 ?v12 ?v6) (pred_7 ?v11 ?v8)
                   (pred_2 ?v6 ?v8) (pred_10 ?v12) 
                   (pred_8 ?v6) (pred_5 ?v11))
:effect (and  (pred_11 ?v6) (not (pred_8 ?v6))))


(:action op_3
:parameters (?v12 ?v3)
:precondition (and (pred_6 ?v12) (pred_6 ?v3)
               (pred_10 ?v12) (pred_3 ?v12 ?v3) (pred_11 ?v3))
:effect (and (pred_10 ?v3) (not (pred_10 ?v12))))

(:action op_2
:parameters (?v12 ?v11)
:precondition (and (pred_6 ?v12) (pred_12 ?v11) 
                  (pred_10 ?v12) (pred_1 ?v11 ?v12) (pred_9 ))
:effect (and (pred_5 ?v11)
   (not (pred_1 ?v11 ?v12)) (not (pred_9 ))))


(:action op_1
:parameters (?v12 ?v4 ?v7)
:precondition (and (pred_6 ?v12) (pred_12 ?v4) (pred_12 ?v7)
                  (pred_10 ?v12) (pred_5 ?v7) (pred_1 ?v4 ?v12))
:effect (and (pred_5 ?v4) (pred_1 ?v7 ?v12)
        (not (pred_5 ?v7)) (not (pred_1 ?v4 ?v12))))

(:action op_4
:parameters (?v12 ?v11)
:precondition (and (pred_6 ?v12) (pred_12 ?v11) 
                  (pred_10 ?v12) (pred_5 ?v11))
:effect (and (pred_9 ) (pred_1 ?v11 ?v12) (not (pred_5 ?v11)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_20 obj_11 obj_13 obj_07 obj_12 obj_17 obj_21 obj_04 obj_06 obj_18 obj_09 obj_02 obj_08 obj_19 obj_01
    obj_10 obj_05
    obj_16 obj_15 obj_03
    )

    (:init
       (pred_9)

       (pred_6 obj_14)
       (pred_6 obj_20)
       (pred_6 obj_11)
       (pred_6 obj_13)
       (pred_6 obj_07)
       (pred_6 obj_12)
       (pred_6 obj_17)
       (pred_6 obj_21)
       (pred_6 obj_04)
       (pred_6 obj_06)
       (pred_6 obj_18)
       (pred_6 obj_09)
       (pred_6 obj_02)
       (pred_6 obj_08)
       (pred_6 obj_19)
       (pred_6 obj_01)
       (pred_4 obj_10)
       (pred_4 obj_05)
       (pred_12 obj_16)
       (pred_12 obj_15)
       (pred_12 obj_03)

       (pred_3 obj_14 obj_07)
       (pred_3 obj_14 obj_20)
       (pred_3 obj_20 obj_12)
       (pred_3 obj_20 obj_11)
       (pred_3 obj_20 obj_14)
       (pred_3 obj_11 obj_17)
       (pred_3 obj_11 obj_13)
       (pred_3 obj_11 obj_20)
       (pred_3 obj_13 obj_21)
       (pred_3 obj_13 obj_11)
       (pred_3 obj_07 obj_04)
       (pred_3 obj_07 obj_12)
       (pred_3 obj_07 obj_14)
       (pred_3 obj_12 obj_06)
       (pred_3 obj_12 obj_17)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_12 obj_07)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_17 obj_21)
       (pred_3 obj_17 obj_11)
       (pred_3 obj_17 obj_12)
       (pred_3 obj_21 obj_09)
       (pred_3 obj_21 obj_13)
       (pred_3 obj_21 obj_17)
       (pred_3 obj_04 obj_02)
       (pred_3 obj_04 obj_06)
       (pred_3 obj_04 obj_07)
       (pred_3 obj_06 obj_08)
       (pred_3 obj_06 obj_18)
       (pred_3 obj_06 obj_12)
       (pred_3 obj_06 obj_04)
       (pred_3 obj_18 obj_19)
       (pred_3 obj_18 obj_09)
       (pred_3 obj_18 obj_17)
       (pred_3 obj_18 obj_06)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_09 obj_21)
       (pred_3 obj_09 obj_18)
       (pred_3 obj_02 obj_08)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_08 obj_19)
       (pred_3 obj_08 obj_06)
       (pred_3 obj_08 obj_02)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_19 obj_18)
       (pred_3 obj_19 obj_08)
       (pred_3 obj_01 obj_09)
       (pred_3 obj_01 obj_19)
       (pred_8 obj_19)
       (pred_8 obj_09)
       (pred_8 obj_14)
       (pred_2  obj_19 obj_10)
       (pred_2  obj_09 obj_05)
       (pred_2  obj_14 obj_10)
       (pred_11 obj_20)
       (pred_11 obj_11)
       (pred_11 obj_13)
       (pred_11 obj_07)
       (pred_11 obj_12)
       (pred_11 obj_17)
       (pred_11 obj_21)
       (pred_11 obj_04)
       (pred_11 obj_06)
       (pred_11 obj_18)
       (pred_11 obj_02)
       (pred_11 obj_08)
       (pred_11 obj_01)

       (pred_7  obj_16 obj_10)
       (pred_7  obj_15 obj_05)
       (pred_7  obj_03 obj_10)
       (pred_1 obj_16 obj_06)
       (pred_1 obj_15 obj_07)
       (pred_1 obj_03 obj_18)
       (pred_10 obj_17)
    )

    (:goal (and
       (pred_1 obj_15 obj_11)
       (pred_1 obj_03 obj_11)
    ))
(:constraints
  (always (not (pred_10 obj_12)))
)
)

; plan
1. (op_3 obj_17 obj_18)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_18)
   goals met: 0 of 2
2. (op_3 obj_18 obj_06)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_06)
   goals met: 0 of 2
3. (op_2 obj_06 obj_16)
   deleted: (pred_1 obj_16 obj_06) (pred_9)
   added: (pred_5 obj_16)
   goals met: 0 of 2
4. (op_3 obj_06 obj_18)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_18)
   goals met: 0 of 2
5. (op_1 obj_18 obj_03 obj_16)
   deleted: (pred_5 obj_16) (pred_1 obj_03 obj_18)
   added: (pred_5 obj_03) (pred_1 obj_16 obj_18)
   goals met: 0 of 2
6. (op_3 obj_18 obj_17)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_17)
   goals met: 0 of 2
7. (op_3 obj_17 obj_11)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_11)
   goals met: 0 of 2
8. (op_3 obj_11 obj_20)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_20)
   goals met: 0 of 2
9. (op_5 obj_20 obj_14 obj_03 obj_10)
   deleted: (pred_8 obj_14)
   added: (pred_11 obj_14)
   goals met: 0 of 2
10. (op_3 obj_20 obj_11)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_11)
   goals met: 0 of 2
11. (op_4 obj_11 obj_03)
   deleted: (pred_5 obj_03)
   added: (pred_9) (pred_1 obj_03 obj_11)
   goals met: 1 of 2
12. (op_3 obj_11 obj_20)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_20)
   goals met: 1 of 2
13. (op_3 obj_20 obj_14)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_14)
   goals met: 1 of 2
14. (op_3 obj_14 obj_07)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_07)
   goals met: 1 of 2
15. (op_2 obj_07 obj_15)
   deleted: (pred_1 obj_15 obj_07) (pred_9)
   added: (pred_5 obj_15)
   goals met: 1 of 2
16. (op_3 obj_07 obj_14)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_14)
   goals met: 1 of 2
17. (op_3 obj_14 obj_20)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_20)
   goals met: 1 of 2
18. (op_3 obj_20 obj_11)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_11)
   goals met: 1 of 2
19. (op_4 obj_11 obj_15)
   deleted: (pred_5 obj_15)
   added: (pred_9) (pred_1 obj_15 obj_11)
   goals met: 2 of 2
